In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt

pd.__version__

'1.0.3'

In [3]:
arr = [0,1,2,3,4]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [4]:
npArr = np.arange(5)
print(type(npArr))
s1_1 = pd.Series(npArr)
s1_1

<class 'numpy.ndarray'>

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [5]:
print(type(s1))

<class 'pandas.core.series.Series'>

In [6]:
npArr = np.array([0,1,2,3,4])
print(type(npArr))
s1_1 = pd.Series(npArr)
s1_1

<class 'numpy.ndarray'>

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [7]:
arr = [0,1,2,3,4]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [9]:
order = [1,2,3,4,5]
s2 = pd.Series(arr, index = order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [10]:
n = np.random.randn(5)
n

array([-2.97980705,  0.44731469, -0.12512668,  1.16329842, -1.70658872])

In [11]:
index = ['a','b','c','d','e']
s2 = pd.Series(n, index = index)
s2

a   -2.979807
b    0.447315
c   -0.125127
d    1.163298
e   -1.706589
dtype: float64

In [12]:
# create a series from dictionary
d = {'a':1,'b':2, 'c':3, 'd':4, 'e':5}
s3 = pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
# you can modify the index of series
print(s1)
print(s1.index)

0    0
1    1
2    2
3    3
4    4
dtype: int64
RangeIndex(start=0, stop=5, step=1)

In [19]:
s1.index = ['A','B','C','D','E']
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [20]:
print(s1.index)

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [22]:
a = s1[:3]
a

A    0
B    1
C    2
dtype: int64

In [23]:
s1[:-1]

A    0
B    1
C    2
D    3
dtype: int64

In [24]:
s2[:-2]

a   -2.979807
b    0.447315
c   -0.125127
dtype: float64

In [25]:
print(s1)
print(s3)
s4 = s1.append(s3)
print(s4)

A    0
B    1
C    2
D    3
E    4
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64
A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [26]:
s4.drop('e') # 'e' 번째 인덱스를 제외하고 출력, s4 series 자체에 변화가 있는것은 아님

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64

In [27]:
s4 = s4.drop('e') # 이거는 'e'번째 row를 완전제거
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64

In [28]:
arr1 = [0,1,2,3,4,5,7]
arr2 = [6,7,8,9,5]

In [29]:
s5 = pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [31]:
s6 = pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [32]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [33]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [34]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [35]:
print("median", s6.median())
print("max",s6.max())
print("min", s6.min())

median 3.0
max 7
min 0

In [36]:
s7 = s5.mul(s6)
s7

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [37]:
print("median", s7.median())
print("max",s7.max())
print("min", s7.min())

median 16.0
max 27.0
min 0.0

In [38]:
dates = pd.date_range('today', periods=6)
dates

DatetimeIndex(['2020-09-22 11:35:47.019840', '2020-09-23 11:35:47.019840',
               '2020-09-24 11:35:47.019840', '2020-09-25 11:35:47.019840',
               '2020-09-26 11:35:47.019840', '2020-09-27 11:35:47.019840'],
              dtype='datetime64[ns]', freq='D')

In [40]:
num_arr = np.random.randn(6,4)
num_arr

array([[-0.41080161, -0.26921775, -0.10096789,  0.13974781],
       [-0.88114334, -0.08217064, -1.18174896,  1.66107064],
       [ 1.37651131, -0.18061028, -0.47348684,  0.17289455],
       [-0.57843271, -0.23077663,  1.75476196,  1.97898837],
       [-0.94641558,  1.092675  ,  0.88671117, -0.81852432],
       [ 0.12651302, -1.14358438, -0.29396878,  1.6195686 ]])

In [41]:
colmuns = ['A','B','C','D']
df1 = pd.DataFrame(num_arr, index = dates, columns = colmuns)
df1

                                   A         B         C         D
2020-09-22 11:35:47.019840 -0.410802 -0.269218 -0.100968  0.139748
2020-09-23 11:35:47.019840 -0.881143 -0.082171 -1.181749  1.661071
2020-09-24 11:35:47.019840  1.376511 -0.180610 -0.473487  0.172895
2020-09-25 11:35:47.019840 -0.578433 -0.230777  1.754762  1.978988
2020-09-26 11:35:47.019840 -0.946416  1.092675  0.886711 -0.818524
2020-09-27 11:35:47.019840  0.126513 -1.143584 -0.293969  1.619569

In [42]:
pd.DataFrame(num_arr)

          0         1         2         3
0 -0.410802 -0.269218 -0.100968  0.139748
1 -0.881143 -0.082171 -1.181749  1.661071
2  1.376511 -0.180610 -0.473487  0.172895
3 -0.578433 -0.230777  1.754762  1.978988
4 -0.946416  1.092675  0.886711 -0.818524
5  0.126513 -1.143584 -0.293969  1.619569

In [49]:
df1 = pd.DataFrame(num_arr, index = [1,2,3,4,5,6], columns = colmuns)
df1

          A         B         C         D
1 -0.410802 -0.269218 -0.100968  0.139748
2 -0.881143 -0.082171 -1.181749  1.661071
3  1.376511 -0.180610 -0.473487  0.172895
4 -0.578433 -0.230777  1.754762  1.978988
5 -0.946416  1.092675  0.886711 -0.818524
6  0.126513 -1.143584 -0.293969  1.619569

In [51]:
data = {'animal' : ['cat', 'cat','snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
         'age' : [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits' : [1,3,2,3,2,3,1,1,2,1],
        'priority' : ['yes', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes', 'no']}
labels = ['a','b','c','d','e','f','g','h','i','j']
df2 = pd.DataFrame(data, index = labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  NaN       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [52]:
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [53]:
df2.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3       no
e    dog  5.0       2      yes

In [54]:
df2.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [75]:
# df3 = df2.head(3)
df3 = df2
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  NaN       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [76]:
df2.tail()

  animal  age  visits priority
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  NaN       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [77]:
df2.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [78]:
df2.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [79]:
df2.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'no'],
       ['dog', 5.0, 2, 'yes'],
       ['cat', 2.0, 3, 'yes'],
       ['snake', 4.5, 1, 'no'],
       ['cat', nan, 1, 'no'],
       ['dog', 7.0, 2, 'yes'],
       ['dog', 3.0, 1, 'no']], dtype=object)

In [80]:
type(df2.values)

numpy.ndarray

In [81]:
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  NaN       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [82]:
df2.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [83]:
df2.T

            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5    3    0.5  NaN    5    2    4.5  NaN    7    3
visits      1    3      2    3    2    3      1    1    2    1
priority  yes  yes     no   no  yes  yes     no   no  yes   no

In [84]:
df2.sort_values(by='age')[1:3]

  animal  age  visits priority
f    cat  2.0       3      yes
a    cat  2.5       1      yes

In [85]:
df2[1:3]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [86]:
#dataframe 쿼리할때, 이때 반드시 대괄호를 한번 더 취해야 한다
df2[['age','visits']]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [87]:
type(df2[['age','visits']])

pandas.core.frame.DataFrame

In [88]:
df2.iloc[1:3]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [89]:
# df2나 df2.iloc 한것이나 차이는 없음
print(type(df2.iloc[1:3]))
print(type(df2[1:3]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [90]:
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  NaN       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [91]:
df3.loc['f','age']

2.0

In [92]:
df3.mean()

age       3.4375
visits    1.9000
dtype: float64

In [93]:
df3[['age']].mean()

age    3.4375
dtype: float64

In [96]:
print(type(df3[['age']].mean())) # series 타입
print(type(df3['age'].mean())) # numpy의 array 타입

<class 'pandas.core.series.Series'>
<class 'numpy.float64'>

In [97]:
print(df3['age'])
type(df3['age'])

a    2.5
b    3.0
c    0.5
d    NaN
e    5.0
f    2.0
g    4.5
h    NaN
i    7.0
j    3.0
Name: age, dtype: float64

pandas.core.series.Series

In [98]:
print(df3[['age']])
type(df3[['age']])

   age
a  2.5
b  3.0
c  0.5
d  NaN
e  5.0
f  2.0
g  4.5
h  NaN
i  7.0
j  3.0

pandas.core.frame.DataFrame

In [102]:
df3['visits'].sum()

19

In [104]:
df3[['visits']].sum()

visits    19
dtype: int64

In [101]:
string = pd.Series(['A','C','D','Aaa','BaCa', np.nan, 'CBA', 'cow', 'owl'])
string

0       A
1       C
2       D
3     Aaa
4    BaCa
5     NaN
6     CBA
7     cow
8     owl
dtype: object

In [105]:
string.str.lower()

0       a
1       c
2       d
3     aaa
4    baca
5     NaN
6     cba
7     cow
8     owl
dtype: object

In [106]:
string.str.upper()

0       A
1       C
2       D
3     AAA
4    BACA
5     NaN
6     CBA
7     COW
8     OWL
dtype: object

In [108]:
df4 = df3.copy()
df4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  NaN       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [109]:
df4.fillna(4, inplace=True)
df4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  4.0       3       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  4.0       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [110]:
df5 = df4.fillna(4)
df5

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  4.0       3       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
h    cat  4.0       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no

In [112]:
df5 = df3.copy()
df5.dropna(how = 'any')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2      yes
f    cat  2.0       3      yes
g  snake  4.5       1       no
i    dog  7.0       2      yes
j    dog  3.0       1       no